import matplotlib.pyplot as plt
import brian2 as br

# 뉴런의 행동 특성을 출력해서 볼 수 있도록 스코프를 세워둔다.
br.start_scope()

###############################################################################
############################# 뉴런 파라미터 ####################################
###############################################################################

# 뉴런의 수 N 선언
N               = 3

# 파라미터 선언.
timeConstant    = 10*br.ms
v0_max          = 3.
runDuration     = 50*br.ms
sigma           = .2
spikeTH         = 'v > 1'
resetVoltage    = 'v = 0'
weightEquation  = 'w : 1'
synapseWeight   = 'j*0.2'        # 뉴런의 인덱스 마다 가중치를 다르게 설정한다.
onPreSpike      = 'v_post += w'

###############################################################################
############################# 뉴런 행동 모델 ###################################
###############################################################################

# 미분 방정식 선언, 삼 따옴표 내부에 기술하고, 단위를 꼭 남겨준다.
# 분자 / 분모의 단위 또한 중요하다. 여기선 (volt / time)
eqs =   '''
        dv/dt = (I - v) / tau    : 1
        I                        : 1
        tau                      : second
        '''
        
###############################################################################
############################# 뉴런 그룹 설정 ###################################
###############################################################################

# 뉴런 그룹 클래스로 뉴런 객체를 만들어준다. (초기화)
G = br.NeuronGroup(
    N                   ,
    eqs                 ,
    threshold=spikeTH   ,
    reset=resetVoltage  ,
    method='exact'
    )

# 뉴런의 시작 전압을 (0, 1)사이에서 결정한다.
# G.v = 'rand()'

# 뉴런의 시작 전압을 (0, v0_max) 사이에서 인덱스 마다 부여한다.
# G.v0 = 'i * v0_max / (N-1)'

# 뉴런의 시작 전류를 인덱스 마다 결정한다.
G.I = [2, 0, 0]

# 뉴런의 감쇠 상수를 뉴런 인덱스 마다 결정한다.
G.tau = [10, 100, 100]*br.ms

###############################################################################
############################# 시냅스 설정 ######################################
###############################################################################

# 시냅스 클래스로 시냅스 연결 객체를 만들어준다.
S = br.Synapses(
    source=G            ,
    target=G            ,
    model=weightEquation,
    on_pre=onPreSpike   ,
    )


# 시냅스 연결을 결정한다. (i, Pre- 뉴런) (j, Post- 뉴런)
S.connect(
    i = 0               ,
    j = [1, 2]          
    )

# 시냅스 가중치를 결정한다.
S.w = synapseWeight

# 시냅스 부분을 주석 처리 하면 입력 스파이크를 받는 첫 번째 뉴런만 활성화 된다.

###############################################################################
############################# 모니터 설정 ######################################
###############################################################################

# 뉴런의 상태를 실시간으로 저장하는 모니터를 만들어준다.
stateMon = br.StateMonitor(
    G                       , # 특정 뉴런 그룹을 모니터링 한다
    'v'                     , # 막 전위를 저장한다.
    record=True
    )

# 스파이크 발생을 저장하는 모니터를 만들어준다.
spikeMon = br.SpikeMonitor(G)

###############################################################################
############################# 시뮬레이션 실행 ###################################
###############################################################################

br.run(runDuration)

###############################################################################
############################# Plot 출력 #######################################
###############################################################################

plt.plot(stateMon.t/br.ms, stateMon.v[0], label='Neuron Idx : 0')
plt.plot(stateMon.t/br.ms, stateMon.v[1], label='Neuron Idx : 1')
plt.plot(stateMon.t/br.ms, stateMon.v[2], label='Neuron Idx : 2')
plt.xlabel('Time (ms)')
plt.ylabel('v')
plt.legend()